
## Terraform plan for environment: `dev`

**Commit:** 1144f9f9352bd22d7020765ff5d210a4492bf3e3


**API version:** 418eb0c
**CLI version:** 418eb0c
**Selfserve version:** 418eb0c
**Internal version:** 418eb0c

### Plan summary

`1 to add, 1 to change, 1 to destroy`

**🆕 Creates**

```tf
module.service.module.cloudfront.aws_cloudfront_origin_access_control.this["s3_oac_dev"]
```
**🗑️ Deletes**

```tf
module.service.module.cloudfront.aws_cloudfront_origin_access_control.this["s3_oac"]
```
**🔄 Updates**

```tf
module.service.module.cloudfront.aws_cloudfront_distribution.this[0]
```


----

<details data-gh-workflow="dev-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.service.module.cloudfront.aws_cloudfront_distribution.this[0] will be updated in-place
  ~ resource "aws_cloudfront_distribution" "this" {
        id                              = "E3R9S2AKJG4ZTR"
        tags                            = {}
        # (22 unchanged attributes hidden)

      ~ default_cache_behavior {
          ~ target_origin_id           = "s3_oac" -> "s3_oac_dev"
            # (15 unchanged attributes hidden)
        }

      ~ ordered_cache_behavior {
          ~ target_origin_id           = "s3_oac" -> "s3_oac_dev"
            # (16 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      - origin {
          - connection_attempts      = 3 -> null
          - connection_timeout       = 10 -> null
          - domain_name              = "vol-app-assets.s3.eu-west-1.amazonaws.com" -> null
          - origin_access_control_id = "E1FW6X81UDPZAI" -> null
          - origin_id                = "s3_oac" -> null
          - origin_path              = "/8c2320a" -> null
        }
      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "vol-app-assets.s3.eu-west-1.amazonaws.com"
          + origin_access_control_id = (known after apply)
          + origin_id                = "s3_oac_dev"
          + origin_path              = "/8c2320a"
        }

        # (3 unchanged blocks hidden)
    }

  # module.service.module.cloudfront.aws_cloudfront_origin_access_control.this["s3_oac"] will be destroyed
  # (because key ["s3_oac"] is not in for_each map)
  - resource "aws_cloudfront_origin_access_control" "this" {
      - description                       = "CloudFront access to S3" -> null
      - etag                              = "ETVPDKIKX0DER" -> null
      - id                                = "E1FW6X81UDPZAI" -> null
      - name                              = "s3_oac" -> null
      - origin_access_control_origin_type = "s3" -> null
      - signing_behavior                  = "always" -> null
      - signing_protocol                  = "sigv4" -> null
    }

  # module.service.module.cloudfront.aws_cloudfront_origin_access_control.this["s3_oac_dev"] will be created
  + resource "aws_cloudfront_origin_access_control" "this" {
      + description                       = "CloudFront dev access to S3"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "s3_oac_dev"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

Plan: 1 to add, 1 to change, 1 to destroy.

```

</details>